mfouda/STM32F746G-piano_audio/Piano/Core/Src/main.c
}

/**
  * @brief  Display Audio Record demo hint
  * @param  None
  * @retval None
  */
static void AudioLoopback_SetHint(void)
{
  /* Clear the LCD */
  BSP_LCD_Clear(LCD_COLOR_WHITE);

  /* Set Audio Demo description */
  BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
  BSP_LCD_FillRect(0, 0, BSP_LCD_GetXSize(), 90);
  BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
  BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
  BSP_LCD_SetFont(&Font24);
  BSP_LCD_DisplayStringAt(0, 0, (uint8_t *)"AUDIO LOOPBACK EXAMPLE", CENTER_MODE);
  BSP_LCD_SetFont(&Font12);
  BSP_LCD_DisplayStringAt(0, 30, (uint8_t *)"Press User button for next menu", CENTER_MODE);

  /* Set the LCD Text Color */
  BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
  BSP_LCD_DrawRect(10, 100, BSP_LCD_GetXSize() - 20, BSP_LCD_GetYSize() - 110);
  BSP_LCD_DrawRect(11, 101, BSP_LCD_GetXSize() - 22, BSP_LCD_GetYSize() - 112);

}

/**
  * @brief  Starts Audio streaming.
  * @param  None
  * @retval Audio error
  */
AUDIO_ErrorTypeDef AUDIO_Start(uint32_t audio_start_address, uint32_t audio_file_size)
{
	uint32_t bytesread;

	buffer_ctl.state = BUFFER_OFFSET_NONE;
	AudioStartAddress = audio_start_address;
	AudioFileSize = audio_file_size;
	bytesread = GetData( (void *)AudioStartAddress,
			0,
			&buffer_ctl.buff[0],
			AUDIO_BUFFER_SIZE);
	if(bytesread > 0)
	{
		/* Clean Data Cache to update the content of the SRAM */
		SCB_CleanDCache_by_Addr((uint32_t*)&buffer_ctl.buff[0], AUDIO_BUFFER_SIZE/2);

		BSP_AUDIO_OUT_Play((uint16_t*)&buffer_ctl.buff[0], AUDIO_BUFFER_SIZE);
		audio_state = AUDIO_STATE_PLAYING;
		buffer_ctl.fptr = bytesread;
		return AUDIO_ERROR_NONE;
	}
	return AUDIO_ERROR_IO;
}

/**
  * @brief  Manages Audio process.
  * @param  None
  * @retval Audio error
  */
uint8_t AUDIO_Process(void)
{
	uint32_t bytesread;
	AUDIO_ErrorTypeDef error_state = AUDIO_ERROR_NONE;

	switch(audio_state)
	{
	case AUDIO_STATE_PLAYING:

		if(buffer_ctl.fptr >= AudioFileSize)
		{
			/* Play audio sample again ... */
			buffer_ctl.fptr = 0;
			error_state = AUDIO_ERROR_EOF;
		}

		/* 1st half buffer played; so fill it and continue playing from bottom*/
		if(buffer_ctl.state == BUFFER_OFFSET_HALF)
		{
			bytesread = GetData((void *)AudioStartAddress,
					buffer_ctl.fptr,
					&buffer_ctl.buff[0],
					AUDIO_BUFFER_SIZE /2);

			if( bytesread >0)
			{
				buffer_ctl.state = BUFFER_OFFSET_NONE;
				buffer_ctl.fptr += bytesread;

				/* Clean Data Cache to update the content of the SRAM */
				SCB_CleanDCache_by_Addr((uint32_t*)&buffer_ctl.buff[0], AUDIO_BUFFER_SIZE/2);
			}
		}

		/* 2nd half buffer played; so fill it and continue playing from top */
		if(buffer_ctl.state == BUFFER_OFFSET_FULL)
		{
			bytesread = GetData((void *)AudioStartAddress,
					buffer_ctl.fptr,
					&buffer_ctl.buff[AUDIO_BUFFER_SIZE /2],
					AUDIO_BUFFER_SIZE /2);
			if( bytesread > 0)
			{
				buffer_ctl.state = BUFFER_OFFSET_NONE;
				buffer_ctl.fptr += bytesread;

				/* Clean Data Cache to update the content of the SRAM */
				SCB_CleanDCache_by_Addr((uint32_t*)&buffer_ctl.buff[AUDIO_BUFFER_SIZE/2], AUDIO_BUFFER_SIZE/2);
			}
		}
		break;

	default:
		error_state = AUDIO_ERROR_NOTREADY;
		break;
	}

	return (uint8_t) error_state;
}

/**
  * @brief  Gets Data from storage unit.
  * @param  None
  * @retval None
  */
static uint32_t GetData(void *pdata, uint32_t offset, uint8_t *pbuf, uint32_t NbrOfData)
{
	uint8_t *lptr = pdata;
	uint32_t ReadDataNbr;

	ReadDataNbr = 0;
	while(((offset + ReadDataNbr) < AudioFileSize) && (ReadDataNbr < NbrOfData))
	{
		pbuf[ReadDataNbr]= lptr [offset + ReadDataNbr];
		ReadDataNbr++;
	}
	return ReadDataNbr;
}

/*------------------------------------------------------------------------------
       Callbacks implementation:
           the callbacks API are defined __weak in the stm32746g_discovery_audio.c file
           and their implementation should be done the user code if they are needed.
           Below some examples of callback implementations.
  ----------------------------------------------------------------------------*/
/**
  * @brief  Manages the full Transfer complete event.
  * @param  None
  * @retval None
  */
void BSP_AUDIO_OUT_TransferComplete_CallBack(void)
{
	if(audio_state == AUDIO_STATE_PLAYING)
	{
		/* allows AUDIO_Process() to refill 2nd part of the buffer  */
		buffer_ctl.state = BUFFER_OFFSET_FULL;
	}
}

/**
  * @brief  Manages the DMA Half Transfer complete event.
  * @param  None
  * @retval None
  */
void BSP_AUDIO_OUT_HalfTransfer_CallBack(void)
{
	if(audio_state == AUDIO_STATE_PLAYING)
	{
		/* allows AUDIO_Process() to refill 1st part of the buffer  */
		buffer_ctl.state = BUFFER_OFFSET_HALF;
	}
}

/**
  * @brief  Manages the DMA FIFO error event.
  * @param  None
  * @retval None
  */
void BSP_AUDIO_OUT_Error_CallBack(void)
{
	/* Display message on the LCD screen */
	BSP_LCD_SetBackColor(LCD_COLOR_RED);
	BSP_LCD_DisplayStringAtLine(14, (uint8_t *)"       DMA  ERROR     ");

	/* Stop the program with an infinite loop */
	while (BSP_PB_GetState(BUTTON_KEY) != RESET)
	{
		return;
	}

  /* could also generate a system reset to recover from the error */
  /* .... */
}

// Interrupt callback function
//void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
//	// Touch screen interrupt
//	if(GPIO_Pin == TS_INT_PIN){
//		HAL_GPIO_TogglePin(LED12_GPIO_Port, LED12_Pin);
//
//		//BSP_TS_ITClear();
//	}
//}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_Audio_demo */
/**
* @brief Function implementing the Audio thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_Audio_demo */
void Audio_demo(void const * argument)
{
  /* USER CODE BEGIN Audio_demo */
	AudioLoopback_SetHint();

	  /* Initialize Audio Recorder */
	  if (BSP_AUDIO_IN_OUT_Init(INPUT_DEVICE_DIGITAL_MICROPHONE_2, OUTPUT_DEVICE_HEADPHONE, DEFAULT_AUDIO_IN_FREQ, DEFAULT_AUDIO_IN_BIT_RESOLUTION, DEFAULT_AUDIO_IN_CHANNEL_NBR) == AUDIO_OK)
	  {
	    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	    BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
	    BSP_LCD_DisplayStringAt(0, BSP_LCD_GetYSize() - 95, (uint8_t *)"  AUDIO RECORD INIT OK  ", CENTER_MODE);
	  }
	  else
	  {
	    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	    BSP_LCD_SetTextColor(LCD_COLOR_RED);
	    BSP_LCD_DisplayStringAt(0, BSP_LCD_GetYSize() - 95, (uint8_t *)"  AUDIO RECORD INIT FAIL", CENTER_MODE);
	    BSP_LCD_DisplayStringAt(0, BSP_LCD_GetYSize() - 80, (uint8_t *)" Try to reset board ", CENTER_MODE);
	  }

	  /* Display the state on the screen */
	  BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
	  BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
	  BSP_LCD_DisplayStringAt(0, BSP_LCD_GetYSize() - 80, (uint8_t *)"Microphones sound streamed to headphones", CENTER_MODE);

	  /* Initialize SDRAM buffers */
	  memset((uint16_t*)AUDIO_BUFFER_IN, 0, AUDIO_BLOCK_SIZE*2);
	  memset((uint16_t*)AUDIO_BUFFER_OUT, 0, AUDIO_BLOCK_SIZE*2);
	  audio_rec_buffer_state = BUFFER_OFFSET_NONE;

	  /* Start Recording */
	  BSP_AUDIO_IN_Record((uint16_t*)AUDIO_BUFFER_IN, AUDIO_BLOCK_SIZE);

	  /* Start Playback */
	  BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
	  BSP_AUDIO_OUT_Play((uint16_t*)AUDIO_BUFFER_OUT, AUDIO_BLOCK_SIZE * 2);
  /* Infinite loop */
  for(;;)
  {
	  /* Wait end of half block recording */
	      while(audio_rec_buffer_state != BUFFER_OFFSET_HALF)
	      {
	        if (CheckForUserInput() > 0)
	        {
	          /* Stop Player before close Test */
	          BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
	          /* Stop Player before close Test */
	          BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
	          return;
	        }
	      }
	      audio_rec_buffer_state = BUFFER_OFFSET_NONE;
	      /* Copy recorded 1st half block */
	      memcpy((uint16_t *)(AUDIO_BUFFER_OUT),
	             (uint16_t *)(AUDIO_BUFFER_IN),
	             AUDIO_BLOCK_SIZE);

	      /* Wait end of one block recording */
	      while(audio_rec_buffer_state != BUFFER_OFFSET_FULL)
	      {
	        if (CheckForUserInput() > 0)
	        {
	          /* Stop Player before close Test */
	          BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
	          /* Stop Player before close Test */
	          BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
	          return;
	        }
	      }
	      audio_rec_buffer_state = BUFFER_OFFSET_NONE;
	      /* Copy recorded 2nd half block */
	      memcpy((uint16_t *)(AUDIO_BUFFER_OUT + (AUDIO_BLOCK_SIZE)),
	             (uint16_t *)(AUDIO_BUFFER_IN + (AUDIO_BLOCK_SIZE)),
	             AUDIO_BLOCK_SIZE);

	      if (CheckForUserInput() > 0)
	      {
	        /* Stop recorder */
	        BSP_AUDIO_IN_Stop(CODEC_PDWN_SW);
	        /* Stop Player before close Test */
	        BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
	        return;
	      }
  }
  /* USER CODE END Audio_demo */
}

/* USER CODE BEGIN Header_TS_scan_task */
/**
* @brief Function implementing the TS_scan thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_TS_scan_task */
void TS_scan_task(void const * argument)
{
  /* USER CODE BEGIN TS_scan_task */
	static TS_StateTypeDef  prev_state;
	TS_StateTypeDef TS_State;
	const TickType_t period = 50;
	TickType_t xLastWakeTime;
	uint8_t w_pressed, b_pressed;
	uint8_t w_old, b_old;

	// Initialise the xLastWakeTime variable with the current time.
	xLastWakeTime = xTaskGetTickCount();

