mfouda/STM32F746G-piano_audio/Piano/Core/Src/main.c
	/* Infinite loop */
	for(;;)
	{
		 BSP_TS_GetState(&TS_State);
		 if(TS_State.touchDetected != prev_state.touchDetected){
			 prev_state.touchDetected = TS_State.touchDetected;
			 nb_appuis = TS_State.touchDetected;
			 w_pressed = 0;
			 b_pressed = 0;
			 for (uint8_t i=0; i<TS_State.touchDetected; i++){
				 if(TS_State.touchY[i] < black_h){
					 for(uint8_t b=0; b<N_black; b++){
						 if(TS_State.touchX[i] > black[b] && TS_State.touchX[i] < black[b]+black_w){
							 b_pressed |= 1<<b;
						 }
					 }
					 for(uint8_t w=0; w<N_white; w++){
						 if(TS_State.touchX[i] > white_up[w] && TS_State.touchX[i] < white_up[w]+white_up_w[w]){
							 w_pressed |= 1<<w;
						 }
					 }
				 } else {
					 for(uint8_t w=0; w<N_white; w++){
						 if(TS_State.touchX[i] > white[w] && TS_State.touchX[i] < white[w]+white_w){
							 w_pressed |= 1<<w;
						 }
					 }
				 }
			 }
			 for(uint8_t b=0; b<N_black; b++){
				 if((b_pressed & (1<<b)) == (1<<b) && (b_old & (1<<b)) == 0){
					 BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
					 BSP_LCD_FillRect(black[b]+1, 1, black_w-1, black_h-1);
				 } else if((b_pressed & (1<<b)) == 0 && (b_old & (1<<b)) == (1<<b)){
					 BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
					 BSP_LCD_FillRect(black[b]+1, 1, black_w-1, black_h-1);
				 }
			 }
			 for(uint8_t w=0; w<N_white; w++){
				 if((w_pressed & (1<<w)) == (1<<w) && (w_old & (1<<w)) == 0){
					 BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
					 BSP_LCD_FillRect(white_up[w]+1, 1, white_up_w[w]-1, black_h-1);
					 BSP_LCD_FillRect(white[w]+1, black_h, white_w-1, white_h);
				 } else if((w_pressed & (1<<w)) == 0 && (w_old & (1<<w)) == (1<<w)){
					 BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
					 BSP_LCD_FillRect(white_up[w]+1, 1, white_up_w[w]-1, black_h-1);
					 BSP_LCD_FillRect(white[w]+1, black_h, white_w-1, white_h);
				 }
			 }
			 b_old = b_pressed;
			 w_old = w_pressed;
		 }
		 vTaskDelayUntil(&xLastWakeTime, period);
	}
  /* USER CODE END TS_scan_task */
}

 /**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
